Repository: vallerian-peter/new-tag-and-seal-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: sw

# longitudeRange
source: Longitude must be between -180 and 180
sw: Longitudo lazima iwe kati ya -180 na 180

source: Get Current Location
sw: Pata Mahali Halisi

# useGpsAutoFill
source: Tap here to use your device GPS to auto-fill coordinates
sw: Gusa hapa kutumia GPS ya kifaa chako kujaza kuratibu kiotomatiki

source: Location Details
sw: Maelezo ya Mahali

source: Legal Information
sw: Taarifa za Kisheria

source: Legal Status
sw: Hali ya Kisheria

source: Select legal status
sw: Chagua hali ya kisheria

# legalStatusRequired
source: Legal status is required
sw: Hali ya kisheria inahitajika

source: Owned
sw: Miliki

source: Leased
sw: Kukodisha

source: Rented
sw: Kukodishwa

source: Cooperative
sw: Ushirika

# reviewBeforeSubmit
source: Review all information before submitting. You can edit later if needed.
sw: Kagua taarifa zote kabla ya kuwasilisha. Unaweza kuhariri baadaye ikiwa unahitaji.

source: Farm registered successfully!
sw: Shamba limesajiliwa kwa mafanikio!

source: Farm registration failed
sw: Usajili wa shamba umeshindwa

source: Farm updated successfully!
sw: Shamba limesasishwa kwa mafanikio!

source: Farm update failed
sw: Usasishaji wa shamba umeshindwa

# confirmRegisterFarm
source: Are you sure you want to register this farm?
sw: Je, una uhakika unataka kusajili shamba hili?

# confirmUpdateFarm
source: Are you sure you want to update this farm?
sw: Je, una uhakika unataka kusasisha shamba hili?

# gpsCoordinatesRetrieved
source: GPS coordinates retrieved successfully!
sw: Kuratibu za GPS zimepatikana kwa mafanikio!

source: Fetching GPS coordinates...
sw: Inapata kuratibu za GPS...

source: Loading farms...
sw: Inapakia mashamba...

source: Farm loaded successfully
sw: Shamba limepokewa kwa mafanikio

# farmLoadFailed
source: Failed to load farm
sw: Imeshindwa kupokea shamba

source: Farms loaded successfully
sw: Mashamba yamepokewa kwa mafanikio

# farmsLoadFailed
source: Failed to load farms
sw: Imeshindwa kupokea mashamba

source: Loading farm with livestock...
sw: Inapakia shamba na mifugo...

source: Farm with livestock loaded successfully
sw: Shamba na mifugo limepokewa kwa mafanikio

source: Events loaded successfully
sw: Matukio yamepakiwa kwa mafanikio

source: All events loaded successfully
sw: Matukio yote yamepakiwa kwa mafanikio

# eventsLoadFailed
source: Failed to load events. Please try again.
sw: Imeshindikana kupakia matukio. Tafadhali jaribu tena.

# feedingLogSaved
source: Feeding log saved successfully
sw: Tukio la kulisha limehifadhiwa kwa mafanikio

# feedingLogSaveFailed
source: Failed to save feeding log. Please try again.
sw: Imeshindikana kuhifadhi tukio la kulisha. Tafadhali jaribu tena.

source: Feeding
sw: Malisho

source: Add Feeding
sw: Ongeza Kulisha

# feedingDetailsSubtitle
source: Capture feeding details for accurate records
sw: Weka taarifa za kulisha kwa kumbukumbu sahihi

# feedingNotesSubtitle
source: Provide optional context and notes
sw: Toa maelezo ya ziada kwa hiari

source: Feeding Details
sw: Maelezo ya Kulisha

source: Feeding Type
sw: Aina ya Kulisha

source: Select feeding type
sw: Chagua aina ya kulisha

# feedingTypeRequired
source: Feeding type is required
sw: Aina ya kulisha inahitajika

source: Amount
sw: Kiasi

source: Enter amount
sw: Ingiza kiasi

# amountRequired
source: Amount is required
sw: Kiasi kinahitajika

source: Next feeding time
sw: Muda ujao wa kulisha

# enterNextFeedingTime
source: Select next feeding time
sw: Chagua muda ujao wa kulisha

# nextFeedingTimeRequired
source: Next feeding time is required
sw: Muda ujao wa kulisha unahitajika

# previousWeight
source: Old weight
sw: Uzito wa awali

# currentWeight
source: New weight
sw: Uzito wa sasa

source: Updated at
sw: Imesasishwa

source: Next administration date
sw: Tarehe ya utoaji inayofuata

source: Dose
sw: Dozi

source: Quantity
sw: Kiasi

source: Created at
sw: Imeundwa

# ensureFeedingDetailsAccuracy
source: Ensure the feeding information is accurate before saving.
sw: Hakikisha taarifa za kulisha ni sahihi kabla ya kuhifadhi.

# ensureWeightDetailsAccuracy
source: Ensure the weight information is accurate before saving.
sw: Hakikisha taarifa za uzito ni sahihi kabla ya kuhifadhi.

source: Additional Notes
sw: Maelezo ya Ziada

source: Remarks
sw: Maelezo

source: Enter remarks (optional)
sw: Ingiza maelezo (hiari)

# feedingNotesInfo
source: Use notes to record any special observations made during feeding.
sw: Tumia maelezo kurekodi uchunguzi wowote maalumu wakati wa kulisha.

# confirmUpdateFeeding
source: Are you sure you want to update this feeding log?
sw: Je, una uhakika unataka kusasisha tukio hili la kulisha?

# confirmSaveFeeding
source: Are you sure you want to save this feeding log?
sw: Je, una uhakika unataka kuhifadhi tukio hili la kulisha?

# confirmSaveWeightChange
source: Are you sure you want to save this weight change?
sw: Je, una uhakika unataka kuhifadhi mabadiliko haya ya uzito?

# confirmUpdateWeightChange
source: Are you sure you want to update this weight change?
sw: Je, una uhakika unataka kusasisha mabadiliko haya ya uzito?

source: Records and Logs
sw: Rekodi na Matukio

source: Insemination
sw: Upandikizaji

source: Pregnancy
sw: Ujauzito

# recordsText
source: Records
sw: Rekodi

source: All Events
sw: Matukio Yote

# eventsScreenSubtitle
source: Review every farm activity log
sw: Pitisha kumbukumbu zote za shughuli za shamba

source: Total Logs
sw: Jumla ya rekodi

source: Event Types
sw: Aina za tukio

source: Ready Offline
sw: Tayari bila mtandao

source: Unsynced Data
sw: Data zisizosawazishwa

# settingsAppHeaderTitle
source: App Settings
sw: Mipangilio ya Programu

# settingsAppHeaderSubtitle
source: Customize your app experience
sw: Badilisha jinsi unavyotumia programu

# settingsAppearanceTitle
source: Appearance
sw: Mwonekano

# settingsLanguageRegionTitle
source: Language & Region
sw: Lugha na Eneo

# settingsSupportTitle
source: Support & About
sw: Msaada na Kuhusu

# settingsThemeDark
source: Dark Mode
sw: Mandhari Meusi

# settingsThemeLight
source: Light Mode
sw: Mandhari ya Mwanga

# settingsAboutSubtitle
source: App version and information
sw: Toleo la programu na taarifa

# settingsHelpSubtitle
source: Get help and support
sw: Pata msaada na usaidizi

source: Privacy Policy
sw: Sera ya Faragha

# privacyPolicySubtitle
source: Read our privacy policy
sw: Soma sera yetu ya faragha

source: Terms of Service
sw: Vigezo vya Huduma

# termsOfServiceSubtitle
source: Read our terms of service
sw: Soma vigezo vyetu vya huduma

# settingsVersionLabel
source: Version: {version}
sw: Toleo: {version}

# settingsAppDescription
source: A comprehensive livestock management application.
sw: Programu kamili ya usimamizi wa mifugo.

# settingsLanguageEnglish
source: English
sw: Kiingereza

source: Bluetooth Weight Scale
sw: Kipimo cha Uzito cha Bluetooth

source: Connect to measure weight
sw: Unganisha kupima uzito

# connectedToDevice
source: Connected to {deviceName}
sw: Imeunganishwa na {deviceName}

source: Unknown device
sw: Kifaa kisichojulikana

source: Scanning for devices...
sw: Inatafuta vifaa...

# makeBluetoothEnabledAndScaleOn
source: Make sure Bluetooth is enabled and the scale is on
sw: Hakikisha Bluetooth imewashwa na kipimo kinawaka

source: No devices found
sw: Hakuna vifaa vilivyopatikana

source: Scan Again
sw: Tafuta Tena

source: Scan
sw: Tafuta

# availableDevices
source: Available Devices ({count})
sw: Vifaa Vilivyopo ({count})

source: Connected
sw: Imeunganishwa

source: Waiting for weight data...
sw: Inangoja data ya uzito...

# placeOnScaleInstruction
source: Place livestock on the scale and wait for a stable reading
sw: Weka mnyama kwenye mzani na usubiri usomaji tulivu

source: Save Weight
sw: Hifadhi Uzito

# dashboardSyncPrompt
source: Tap the sync button to pull the latest farms, livestock, and logs before you start working.
sw: Gonga kitufe cha kusawazisha ili kupakua mashamba, mifugo na kumbukumbu mpya kabla ya kuanza kazi.

source: Bulk
sw: Kwa wingi

source: Bulk Actions
sw: Vitendo vya wingi

# logsText
source: Logs
sw: Rekodi

source: Deworming
sw: Dawa za minyoo

source: Add Deworming
sw: Ongeza dawa za minyoo

source: Deworming Details
sw: Maelezo ya dawa za minyoo

source: Dosage Details
sw: Maelezo ya dozi

source: Administration route
sw: Njia ya utoaji

source: Select administration route
sw: Chagua njia ya utoaji

# administrationRouteRequired
source: Administration route is required
sw: Njia ya utoaji inahitajika

source: Medicine
sw: Dawa

source: Select medicine
sw: Chagua dawa

# medicineRequired
source: Medicine is required
sw: Dawa inahitajika

source: Treatment provider
sw: Mtoa huduma

source: Select treatment provider
sw: Chagua mtoa huduma

# treatmentProviderNone
source: No provider
sw: Hakuna mtoa huduma

# treatmentProviderVet
source: Veterinarian
sw: Daktari wa mifugo

# treatmentProviderExtensionOfficer
source: Extension officer
sw: Afisa ugani

# medicalLicenseNumber
source: License number
sw: Nambari ya leseni

# enterMedicalLicenseNumber
source: Enter license number
sw: Ingiza nambari ya leseni

# medicalLicenseNumberRequired
source: License number is required
sw: Nambari ya leseni inahitajika

# medicalLicenseNumberInvalid
source: License number must contain digits only
sw: Nambari ya leseni inapaswa kuwa tarakimu pekee

source: Vet license
sw: Leseni ya daktari wa mifugo

source: Extension officer license
sw: Leseni ya afisa ugani

source: Enter quantity
sw: Ingiza kiasi

# quantityRequired
source: Quantity is required
sw: Kiasi kinahitajika

source: Enter dose
sw: Ingiza dozi

# doseRequired
source: Dose is required
sw: Dozi inahitajika

# ensureDewormingDetailsAccuracy
source: Ensure the deworming information is accurate before saving.
sw: Hakikisha taarifa za dawa za minyoo ni sahihi kabla ya kuhifadhi.

source: Weight Change
sw: Mabadiliko ya Uzito

source: Disposal / Transfer
sw: Uhamisho/Uuzaji

source: Calving
sw: Kuzaa

source: Vaccination
sw: Chanjo

source: Dryoff
sw: Kuacha Kunyonyesha

source: Medication
sw: Matibabu

source: Milking
sw: Kukamua

source: Coming soon
sw: Inakuja hivi karibuni

# logContextMissing
source: Cannot open this log because farm or livestock details are missing.
sw: Haiwezekani kufungua rekodi hii kwa sababu taarifa za shamba au mnyama hazikupatikana.

source: Select farm
sw: Chagua shamba

# farmRequired
source: Farm is required
sw: Shamba linahitajika

source: Select livestock
sw: Chagua mnyama

# livestockRequired
source: Livestock is required
sw: Mnyama anahitajika

# weightLogSaved
source: Weight change log saved successfully
sw: Tukio la mabadiliko ya uzito limehifadhiwa kwa mafanikio

# weightLogSaveFailed
source: Failed to save weight change log. Please try again.
sw: Imeshindikana kuhifadhi tukio la mabadiliko ya uzito. Tafadhali jaribu tena.

# dewormingLogSaved
source: Deworming log saved successfully
sw: Tukio la kutoa minyoo limehifadhiwa kwa mafanikio

# dewormingLogSaveFailed
source: Failed to save deworming log. Please try again.
sw: Imeshindikana kuhifadhi tukio la kutoa minyoo. Tafadhali jaribu tena.

source: Medication details
sw: Maelezo ya matibabu

# medicationDetailsSubtitle
source: Capture dosage, disease, and scheduling information.
sw: Weka kipimo, ugonjwa na ratiba ya dawa.

# addMedication
source: Add medication log
sw: Ongeza rekodi ya matibabu

# medicationLogSaved
source: Medication log saved successfully
sw: Rekodi ya matibabu imehifadhiwa kikamilifu

# medicationLogSaveFailed
source: Failed to save medication log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya matibabu. Jaribu tena.

# medicationContextInfo
source: Provide context about this medication treatment.
sw: Toa maelezo ya tukio hili la matibabu.

source: Quantity unit
sw: Kipimo cha kiasi

source: Select quantity unit
sw: Chagua kipimo cha kiasi

source: Withdrawal period
sw: Muda wa kujiondoa

source: Enter withdrawal period (optional)
sw: Ingiza muda wa kujiondoa (si lazima)

source: Withdrawal unit
sw: Kipimo cha muda wa kujiondoa

source: Select withdrawal unit
sw: Chagua kipimo cha muda wa kujiondoa

# diseaseOptionsMissing
source: Diseases not available. Sync reference data first.
sw: Hakuna magonjwa. Sawazisha data ya marejeo kwanza.

# diseaseId
source: Disease
sw: Ugonjwa

source: Select disease
sw: Chagua ugonjwa

source: Medication date
sw: Tarehe ya matibabu

source: Select medication date
sw: Chagua tarehe ya matibabu

# medicationNotesInfo
source: Provide any additional notes about this medication.
sw: Ongeza maelezo yoyote kuhusu matibabu haya.

# confirmUpdateMedication
source: Update medication record?
sw: Sasisha rekodi ya matibabu?

# confirmSaveMedication
source: Save medication record?
sw: Hifadhi rekodi ya matibabu?

# withdrawalUnitMinutes
source: minutes
sw: dakika

# withdrawalUnitHours
source: hours
sw: saa

# withdrawalUnitDays
source: days
sw: siku

# withdrawalUnitWeeks
source: weeks
sw: wiki

# withdrawalUnitMonths
source: months
sw: miezi

# withdrawalUnitYears
source: years
sw: miaka

source: Vaccination details
sw: Maelezo ya chanjo

# vaccinationDetailsSubtitle
source: Record vaccine, disease, and schedule info.
sw: Rekodi chanjo, ugonjwa na ratiba.

# addVaccination
source: Add vaccination log
sw: Ongeza rekodi ya chanjo

source: Vaccination number
sw: Namba ya chanjo

source: Enter vaccination number
sw: Ingiza namba ya chanjo

source: Select vaccine
sw: Chagua chanjo

source: Vaccination status
sw: Hali ya chanjo

# vaccinationContextInfo
source: Provide context about this vaccination event.
sw: Toa maelezo kuhusu tukio hili la chanjo.

# vaccinationPersonnelDetails
source: Personnel details
sw: Maelezo ya wahusika

source: Enter vet license (optional)
sw: Ingiza leseni ya daktari wa mifugo (si lazima)

source: Enter extension officer license (optional)
sw: Ingiza leseni ya afisa ugani (si lazima)

# vaccinationNotesInfo
source: Add remarks about this vaccination.
sw: Ongeza maelezo kuhusu chanjo hii.

# confirmUpdateVaccination
source: Update vaccination log?
sw: Sasisha rekodi ya chanjo?

# confirmSaveVaccination
source: Save vaccination log?
sw: Hifadhi rekodi ya chanjo?

# vaccinationLogSaved
source: Vaccination log saved successfully
sw: Rekodi ya chanjo imehifadhiwa kikamilifu

# vaccinationLogSaveFailed
source: Failed to save vaccination log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya chanjo. Jaribu tena.

# vaccineOptionsMissing
source: Vaccines not available. Sync vaccine reference data first.
sw: Hakuna chanjo. Sawazisha data ya chanjo kwanza.

# addDisposal
source: Add disposal log
sw: Ongeza rekodi ya uondoaji

source: Disposal details
sw: Maelezo ya uondoaji

# disposalDetailsSubtitle
source: Capture why and how the livestock was disposed.
sw: Eleza sababu na mbinu ya uondoaji.

# disposalContextInfo
source: Provide the method, reason, and any supporting notes.
sw: Toa maelezo ya njia, sababu na maelezo ya ziada.

source: Disposal reasons
sw: Sababu za uondoaji

# enterDisposalReasons
source: Enter reasons for disposal
sw: Ingiza sababu za uondoaji

# disposalTypeOptionsMissing
source: Disposal types unavailable. Sync reference data.
sw: Aina za uondoaji hazipatikani. Sawazisha data rejea.

# disposalTypeId
source: Disposal type
sw: Aina ya uondoaji

source: Select disposal type
sw: Chagua aina ya uondoaji

# disposalTypeRequired
source: Disposal type is required
sw: Aina ya uondoaji inahitajika

source: Disposal status
sw: Hali ya uondoaji

# disposalNotesInfo
source: Add any remarks related to this disposal.
sw: Ongeza maelezo kuhusu uondoaji huu.

# confirmUpdateDisposal
source: Update disposal log?
sw: Sasisha rekodi ya uondoaji?

# confirmSaveDisposal
source: Save disposal log?
sw: Hifadhi rekodi ya uondoaji?

# disposalLogSaved
source: Disposal log saved successfully
sw: Rekodi ya utupaji imehifadhiwa kikamilifu

# disposalLogSaveFailed
source: Failed to save disposal log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya utupaji. Jaribu tena.

# addMilking
source: Add milking log
sw: Ongeza rekodi ya kukamua

# milkingDetailsSubtitle
source: Capture session details for this milking event.
sw: Rekodi maelezo ya kipindi hiki cha kukamua.

# milkingNotesSubtitle
source: Provide lab readings and quality observations.
sw: Weka vipimo vya maabara na maelezo ya ubora.

source: Milking method
sw: Mbinu ya kukamua

# milkingMethodRequired
source: Milking method is required
sw: Mbinu ya kukamua inahitajika

source: Session
sw: Kipindi

# statusActive
source: Active
sw: Inatumika

# statusNotActive
source: Not active
sw: Haipo hai

# ensureMilkingDetailsAccuracy
source: Ensure the milking details are accurate before saving.
sw: Hakikisha maelezo ya kukamua ni sahihi kabla ya kuhifadhi.

source: Lactometer reading
sw: Kipimo cha lactometer

source: Solids
sw: Alumini

# solidNonFat
source: Solids non-fat
sw: Alumini zisizo na mafuta

source: Protein
sw: Protini

source: Corrected lactometer reading
sw: Kipimo kilichorekebishwa cha lactometer

source: Total solids
sw: Alumini jumla

source: Colony forming units
sw: Viumbe vinavyounda koloni

source: Acidity
sw: Asidi

# milkingNotesInfo
source: Record lab analysis, quality metrics, or remarks.
sw: Rekodi uchambuzi wa maabara na viashiria vya ubora.

# confirmUpdateMilking
source: Update milking log?
sw: Sasisha rekodi ya kukamua?

# confirmSaveMilking
source: Save milking log?
sw: Hifadhi rekodi ya kukamua?

# milkingLogSaveFailed
source: Failed to save milking log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya kukamua. Jaribu tena.

# addPregnancy
source: Add pregnancy log
sw: Ongeza rekodi ya ujauzito

# pregnancyDetailsSubtitle
source: Record pregnancy test outcomes and status.
sw: Rekodi matokeo ya vipimo vya ujauzito na hali.

# pregnancyNotesSubtitle
source: Provide notes about this pregnancy check.
sw: Ongeza maelezo kuhusu uchunguzi huu wa ujauzito.

source: Test result
sw: Matokeo ya kipimo

# testResultRequired
source: Test result is required
sw: Matokeo ya kipimo yanahitajika

source: Number of months
sw: Idadi ya miezi

source: Test date
sw: Tarehe ya kipimo

# testDateRequired
source: Test date is required
sw: Tarehe ya kipimo inahitajika

# ensurePregnancyDetailsAccuracy
source: Ensure pregnancy information is accurate before saving.
sw: Hakikisha taarifa za ujauzito ni sahihi kabla ya kuhifadhi.

# pregnancyNotesInfo
source: Add notes about symptoms, vet observations, or remarks.
sw: Ongeza maelezo kuhusu dalili au ripoti ya daktari.

# confirmUpdatePregnancy
source: Update pregnancy log?
sw: Sasisha rekodi ya ujauzito?

# confirmSavePregnancy
source: Save pregnancy log?
sw: Hifadhi rekodi ya ujauzito?

# pregnancyLogSaveFailed
source: Failed to save pregnancy log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya ujauzito. Jaribu tena.

source: Transfer
sw: Uhamisho

# addTransfer
source: Add transfer log
sw: Ongeza rekodi ya uhamisho

source: Transfer details
sw: Maelezo ya uhamisho

# transferDetailsSubtitle
source: Track livestock movement between farms.
sw: Fuatilia uhamisho wa mifugo kati ya mashamba.

# transferContextInfo
source: Provide the destination farm and transporter information.
sw: Toa taarifa za shamba lengwa na msafirishaji.

# toFarmUuidLabel
source: Destination farm UUID
sw: UUID ya shamba lengwa

# enterToFarmUuid
source: Enter destination farm UUID
sw: Ingiza UUID ya shamba lengwa

# toFarmUuidRequired
source: Destination farm UUID is required
sw: UUID ya shamba lengwa inahitajika

# transferToFarmUuidWarning
source: Ensure the destination farm exists before saving.
sw: Hakikisha shamba lengwa lipo kabla ya kuhifadhi.

# transporterIdLabel
source: Transporter ID
sw: Kitambulisho cha msafirishaji

# enterTransporterId
source: Enter transporter identifier
sw: Ingiza kitambulisho cha msafirishaji

source: Reason
sw: Sababu

# enterTransferReason
source: Enter reason for transfer
sw: Ingiza sababu ya uhamisho

# transferPriceLabel
source: Transfer price
sw: Bei ya uhamisho

# enterTransferPrice
source: Enter price (optional)
sw: Ingiza bei (si lazima)

# transferCurrencyLabel
source: Currency
sw: Sarafu

# selectTransferCurrency
source: Select currency
sw: Chagua sarafu

# transferDateLabel
source: Transfer date
sw: Tarehe ya uhamisho

source: Select transfer date
sw: Chagua tarehe ya uhamisho

# transferDateRequired
source: Transfer date is required
sw: Tarehe ya uhamisho inahitajika

# transferStatusLabel
source: Transfer status
sw: Hali ya uhamisho

# confirmUpdateTransfer
source: Update transfer log?
sw: Sasisha rekodi ya uhamisho?

# confirmSaveTransfer
source: Save transfer log?
sw: Hifadhi rekodi ya uhamisho?

# invalidTransporterId
source: Transporter ID must be alphanumeric.
sw: Kitambulisho cha msafirishaji kinapaswa kuwa herufi au namba.

# transferLogSaveFailed
source: Failed to save transfer log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya uhamisho. Jaribu tena.

# addDryoff
source: Add dryoff log
sw: Ongeza rekodi ya kuacha kunyonyesha

# dryoffDetailsSubtitle
source: Record the planned dryoff window.
sw: Rekodi ratiba ya kuacha kunyonyesha.

# dryoffNotesSubtitle
source: Capture any feeding or management notes.
sw: Ongeza maelezo ya lishe au usimamizi.

source: Start date
sw: Tarehe ya kuanza

# startDateRequired
source: Start date is required
sw: Tarehe ya kuanza inahitajika

source: End date
sw: Tarehe ya kumaliza

# ensureDryoffDetailsAccuracy
source: Ensure the dryoff details are accurate before saving.
sw: Hakikisha taarifa za kuacha kunyonyesha ni sahihi kabla ya kuhifadhi.

# dryoffNotesInfo
source: Add remarks about feed changes, health checks, or reminders.
sw: Ongeza maelezo kuhusu mabadiliko ya chakula, afya au ukaguzi.

# confirmUpdateDryoff
source: Update dryoff log?
sw: Sasisha rekodi ya kuacha kunyonyesha?

# confirmSaveDryoff
source: Save dryoff log?
sw: Hifadhi rekodi ya kuacha kunyonyesha?

# dryoffLogSaveFailed
source: Failed to save dryoff log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya kuacha kunyonyesha. Jaribu tena.

# bulkOperationInProgress
source: Saving records for all selected livestock...
sw: Inahifadhi rekodi kwa mifugo yote iliyochaguliwa...

# addInsemination
source: Add insemination log
sw: Ongeza rekodi ya upandikizaji

# inseminationDetailsSubtitle
source: Record heat cycle, service type, and straw details.
sw: Rekodi mzunguko wa joto, huduma na maelezo ya manii.

# inseminationNotesSubtitle
source: Capture remarks about semen quality or procedures.
sw: Ongeza maelezo kuhusu ubora wa manii au taratibu.

source: Last heat date
sw: Tarehe ya joto la mwisho

source: Heat type
sw: Aina ya joto

# heatTypeRequired
source: Heat type is required
sw: Aina ya joto inahitajika

source: Insemination service
sw: Huduma ya upandikizaji

# inseminationServiceRequired
source: Insemination service is required
sw: Huduma ya upandikizaji inahitajika

source: Semen straw type
sw: Aina ya majani ya manii

# semenStrawTypeRequired
source: Semen straw type is required
sw: Aina ya majani ya manii inahitajika

source: Insemination date
sw: Tarehe ya upandikizaji

# ensureInseminationDetailsAccuracy
source: Ensure insemination details are accurate before saving.
sw: Hakikisha taarifa za upandikizaji ni sahihi kabla ya kuhifadhi.

source: Bull code
sw: Nambari ya fahali

source: Bull breed
sw: Aina ya fahali

source: Semen production date
sw: Tarehe ya kutengeneza manii

source: Production country
sw: Nchi ya uzalishaji

# semenBatchNumber
source: Batch number
sw: Nambari ya kundi

source: International ID
sw: Kitambulisho cha kimataifa

source: AI code
sw: Nambari ya AI

source: Manufacturer name
sw: Jina la mtengenezaji

source: Semen supplier
sw: Msambazaji wa manii

# inseminationNotesInfo
source: Add notes about handling, technician, or follow-up plans.
sw: Ongeza maelezo kuhusu kushughulikia, fundi au mpango wa ufuatiliaji.
