Repository: vallerian-peter/new-tag-and-seal-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Welcome
sw: Karibu

# welcomeTitle
source: Welcome to Tag & Seal
sw: Karibu kwenye Tag & Seal

# welcomeSubtitle
source: Let's help you identify and secure your livestock
sw: Hebu tukusaidie kutambua na kuhifadhi mifugo yako

# tagline
source: My Livestock | Tag & Seal
sw: Ng'ombe Wangu | Tag & Seal

# allText
source: All
sw: Yote

# foundText
source: Found
sw: Imepatikana

source: Get Started
sw: Anza

source: Skip
sw: Ruka

source: Next
sw: Ifuatayo

source: Back
sw: Rudi

# allLivestocksText
source: All Livestocks
sw: Mifugo Wote

# continueButton
source: Continue
sw: Endelea

source: Cancel
sw: Ghairi

source: Save
sw: Hifadhi

source: Delete
sw: Futa

# deleteConfirmationMessage
source: Are you sure you want to delete this farm?
sw: Je, una uhakika unataka kufuta shamba hili?

source: Edit
sw: Hariri

source: Update
sw: Sasisha

source: Close
sw: Funga

source: OK
sw: Sawa

source: Yes
sw: Ndiyo

source: No
sw: Hapana

source: Optional
sw: Si Lazima

source: Sync
sw: Sawazisha

source: Sync Data
sw: Sawazisha Data

source: Syncing...
sw: Inasawazisha...

# syncTitle
source: Syncing Data
sw: Inasawazisha Data

# syncStarting
source: Starting sync...
sw: Inaanza kusawazisha...

# syncAdditionalData
source: Syncing additional data...
sw: Inasawazisha data za ziada...

# syncLivestockReference
source: Syncing livestock reference data...
sw: Inasawazisha data za mifugo...

# syncLivestockData
source: Syncing livestock data...
sw: Inasawazisha data za mifugo...

# syncFarmData
source: Syncing farm data...
sw: Inasawazisha data za shamba...

# syncCompleted
source: Sync completed successfully!
sw: Kusawazisha kumekamilika!

source: Sync Successful
sw: Kusawazisha Kumefanikiwa

# syncSuccessfulMessage
source: All data has been synchronized successfully. Your app is now up to date.
sw: Data zote zimesawazishwa kwa mafanikio. Programu yako ni ya kisasa.

source: Sync failed
sw: Usawazishaji umeshindwa

# syncFailedMessage
source: Failed to synchronize data. Please check your internet connection and try again.
sw: Imeshindwa kusawazisha data. Tafadhali angalia muunganisho wa mtandao na ujaribu tena.

source: Retry
sw: Jaribu tena

source: steps completed
sw: hatua zimekamilika

# manageAndTrackLivestockText
source: Manage and track all your livestock
sw: Simamia na hariri mifugo wote

source: Refresh
sw: Onyesha Upya

source: Livestock Name
sw: Jina la Mfugo

source: Farm Data Not Found
sw: Data za Shamba Hazipo

source: Age
sw: Umri

source: Weight
sw: Uzito

source: year
sw: mwaka

source: years
sw: miaka

source: month
sw: mwezi

source: months
sw: miezi

source: Unknown Farm
sw: Shamba Lisilojulikana

source: Unknown Location
sw: Mahali Pasiojulikana

source: Tap for more details
sw: Gusa kwa maelezo zaidi

# addFirstLivestockMessage
source: Add your first livestock to get started
sw: Ongeza mifugo wako wa kwanza ili kuanza

source: No results found
sw: Hakuna matokeo yaliyopatikana

# tryDifferentKeywords
source: Try searching with different keywords
sw: Jaribu kutafuta kwa maneno tofauti

source: Sort A to Z
sw: Panga A hadi Z

source: Sort Z to A
sw: Panga Z hadi A

source: Newest First
sw: Mpya Kwanza

source: Oldest First
sw: Za Zamani Kwanza

source: Livestock Details
sw: Maelezo ya Mifugo

source: Invalid farm ID
sw: Kitambulisho cha shamba si sahihi

source: Failed to mark farm for deletion
sw: Imeshindwa kuweka alama ya shamba kwa ufutaji

source: Error deleting farm
sw: Hitilafu katika kufuta shamba

source: No Internet Connection
sw: Hakuna Mtandao

# checkInternetConnection
source: Please check your internet connection and try again.
sw: Tafadhali angalia muunganisho wa mtandao wako na ujaribu tena.

source: Checking network connection...
sw: Inaangalia muunganisho wa mtandao...

source: Connection Error
sw: Hitilafu ya Muunganisho

# connectionErrorMessage
source: Unable to connect to the server. Please check your internet connection and try again.
sw: Hawezi kuunganisha na seva. Tafadhali angalia muunganisho wa mtandao wako na ujaribu tena.

source: Connection Timeout
sw: Muda wa Muunganisho umeisha

# connectionTimeoutMessage
source: The server took too long to respond. Please try again.
sw: Seva ilichukua muda mrefu kujibu. Tafadhali ujaribu tena.

source: Network Error
sw: Hitilafu ya Mtandao

# networkErrorMessage
source: Network error. Please check your internet connection.
sw: Hitilafu ya mtandao. Tafadhali angalia muunganisho wa mtandao wako.

source: Authentication Failed
sw: Uthibitishaji Umeshindwa

# authenticationFailedMessage
source: Invalid credentials. Please check your email and password.
sw: Maktaba isiyo sahihi. Tafadhali angalia barua pepe yako na nywila.

source: Server Error
sw: Hitilafu ya Seva

# serverErrorMessage
source: Server error occurred. Please try again later.
sw: Hitilafu ya seva imetokea. Tafadhali ujaribu tena baadaye.

source: Service Unavailable
sw: Huduma Haipatikani

# serviceUnavailableMessage
source: Service temporarily unavailable. Please try again later.
sw: Huduma imekwisha muda kwa muda. Tafadhali ujaribu tena baadaye.

source: Invalid Server Response
sw: Jibu Lisilo sahihi la Seva

# invalidServerResponseMessage
source: The server returned unexpected data. Please try again.
sw: Seva imerudisha data isiyotarajiwa. Tafadhali ujaribu tena.

source: User Data Available
sw: Data za mtumiaji zipo

source: Welcome Again
sw: Karibu tena

# continueTrackingYourLivestocks
source: Continue tracking your livestocks with us
sw: Endelea kuangalia mifugo yako nasi

source: Login
sw: Ingia

source: Register
sw: Jisajili

source: Logout
sw: Toka

source: Username
sw: Jina la Mtumiaji

source: Email
sw: Barua Pepe

source: Password
sw: Nywila

source: Confirm Password
sw: Thibitisha Nywila

source: Forgot Password?
sw: Umesahau Nywila?

# dontHaveAccount
source: Don't have an account?
sw: Huna akaunti?

# alreadyHaveAccount
source: Already have an account?
sw: Tayari una akaunti?

# onboarding1Title
source: Track Your Livestock
sw: Fuatilia Mifugo Yako

# onboarding1Subtitle
source: Efficiently manage and track all your livestock with digital tags and real-time monitoring
sw: Simamia na kufuatilia mifugo yako kwa ufanisi kwa kutumia lebo za kidijitali na ufuatiliaji wa wakati halisi

# onboarding2Title
source: Farm Management
sw: Usimamizi wa Shamba

# onboarding2Subtitle
source: Comprehensive farm management system to organize your farms, animals, and operations in one place
sw: Mfumo kamili wa usimamizi wa shamba kupanga mashamba, wanyama na shughuli zako mahali pamoja

# onboarding3Title
source: Health & Records
sw: Afya na Kumbukumbu

# onboarding3Subtitle
source: Keep detailed health records, vaccinations, and breeding information for better livestock care
sw: Weka kumbukumbu kamili za afya ikiwemo chanjo, dawa na matibabu kwa huduma bora ya mifugo

source: Farm
sw: Shamba

source: Farms
sw: Mashamba

source: All Farms
sw: Mashamba Yote

# allFarmsDescription
source: View and manage all your farms
sw: Angalia na usimamishe mashamba yako yote

source: Add Farm
sw: Ongeza Shamba

source: Farm Name
sw: Jina la Shamba

source: Farm Size
sw: Ukubwa wa Shamba

source: Location
sw: Mahali

source: Livestock
sw: Mifugo

source: Add Livestock
sw: Ongeza Mifugo

source: Tag ID
sw: Nambari ya Lebo

source: Animal Name
sw: Jina la Mnyama

source: Breed
sw: Aina

source: Species
sw: Spishi

source: Gender
sw: Jinsia

source: Date of Birth
sw: Tarehe ya Kuzaliwa

source: Settings
sw: Mipangilio

source: Profile
sw: Wasifu

source: Language
sw: Lugha

source: Theme
sw: Mandhari

source: Notifications
sw: Arifa

source: About
sw: Kuhusu

source: Help & Support
sw: Msaada na Usaidizi

source: How It Works
sw: Jinsi Inavyofanya Kazi

source: Key Features
sw: Vipengele Muhimu

source: How to Use
sw: Jinsi ya Kutumia

source: Digital Tagging
sw: Kuweka Lebo za Kidijitali

source: Health Records
sw: Kumbukumbu za Afya

# analytics
source: Analytics & Reports
sw: Uchambuzi na Ripoti

source: Offline Capability
sw: Uwezo wa Kufanya Kazi Bila Mtandao

source: Tag your Livestock
sw: Weka Lebo Mifugo Yako

# keepTrackFarms
source: Keep Track of your Farms
sw: Fuatilia Mashamba Yako

# inviteUsers
source: Invite Users and Officers
sw: Karibisha Watumiaji na Maofisa

source: Loading data...
sw: Inapakia data...

# syncingData
source: Please wait, syncing data...
sw: Tafadhali subiri, inasawazisha data...

source: Success
sw: Mafanikio

source: Error
sw: Hitilafu

source: Warning
sw: Onyo

# info
source: Information
sw: Taarifa

source: Loading...
sw: Inapakia...

# noData
source: No data available
sw: Hakuna data

source: Try Again
sw: Jaribu Tena

# syncSuccess
source: Sync successful
sw: Usawazishaji umefanikiwa

source: Last sync
sw: Usawazishaji wa mwisho

# howItWorksTitle
source: How It Works
sw: Jinsi Inavyofanya Kazi

# systemTitle
source: Tag & Seal Livestock System
sw: Mfumo wa Tag & Seal wa Mifugo

# systemSubtitle
source: A comprehensive digital solution for livestock management
sw: Suluhisho la kidijitali la kukamilika la usimamizi wa mifugo

# digitalTaggingDesc
source: Tag your livestock with unique identifiers for easy tracking and management
sw: Weka alama za mifugo yako kwa vitambulisho vya kipekee kwa ufuatiliaji rahisi na usimamizi

# healthRecordsDesc
source: Maintain complete health records including vaccinations, medications, and treatments
sw: Hifadhi rekodi kamili za afya pamoja na chanjo, dawa, na matibabu

source: Analytics & Reports
sw: Uchambuzi na Ripoti

# analyticsReportsDesc
source: Get insights into your farm performance with detailed analytics and reports
sw: Pata maarifa juu ya utendaji wa shamba lako kwa uchambuzi wa kina na ripoti

# offlineCapabilityDesc
source: Work offline and sync your data automatically when internet is available
sw: Fanya kazi bila mtandao na sawazisha data yako kiotomatiki wakati mtandao unapatikana

# registerFarm
source: Register Your Farm
sw: Sajili Shamba Lako

# registerFarmDesc
source: Create your farm profile with location details and farm information
sw: Unda wasifu wa shamba lako na maelezo ya eneo na taarifa za shamba

# addLivestockDesc
source: Register your animals with digital tags and basic information
sw: Sajili wanyama wako kwa alama za kidijitali na taarifa za msingi

source: Track & Manage
sw: Fuatilia na Simamia

# trackManageDesc
source: Record health events, breeding, feeding, and other activities
sw: Rekodi matukio ya afya, uzalishaji, kulisha, na shughuli zingine

source: Sync & Analyze
sw: Sawazisha na Chambua

# syncAnalyzeDesc
source: Sync your data to the cloud and view analytics on your farm performance
sw: Sawazisha data yako kwenye wingu na angalia uchambuzi wa utendaji wa shamba lako

source: Got It!
sw: Nimeelewa!

# enterCredentialsToContinue
source: Enter your credentials to continue
sw: Ingiza taarifa zako ili kuendelea

# emailHint
source: example@email.com
sw: mfano@baruapepe.com

# passwordHint
source: Enter your password
sw: Ingiza nywila yako

# pleaseEnterEmail
source: Please enter your email
sw: Tafadhali ingiza barua pepe yako

# pleaseEnterValidEmail
source: Please enter a valid email
sw: Tafadhali ingiza barua pepe halali

# pleaseEnterPassword
source: Please enter your password
sw: Tafadhali ingiza nywila yako

# passwordMinLength
source: Password must be at least 6 characters
sw: Nywila lazima iwe angalau herufi 6

source: Or continue with
sw: Au endelea na

source: Create Account
sw: Unda Akaunti

source: Personal Information
sw: Taarifa za Kibinafsi

source: Contact Details
sw: Maelezo ya Mawasiliano

source: Address Information
sw: Taarifa za Anwani

source: Additional Details
sw: Taarifa Zaidi

source: First Name
sw: Jina la Kwanza

source: Middle Name
sw: Jina la Kati

source: Surname
sw: Jina la Ukoo

# phone1
source: Primary Phone
sw: Simu ya Kwanza

# phone2
source: Secondary Phone
sw: Simu ya Pili

source: Physical Address
sw: Anwani ya Kimwili

source: Farmer Organization Membership
sw: Uanachama wa Shirika la Wakulima

source: Identity Card Type
sw: Aina ya Kitambulisho

source: Identity Number
sw: Nambari ya Utambulisho

source: Street
sw: Mtaa

source: School Level
sw: Kiwango cha Elimu

source: Village
sw: Kijiji

source: Ward
sw: Kata

source: District
sw: Wilaya

source: Region
sw: Mkoa

source: Country
sw: Nchi

source: Farmer Type
sw: Aina ya Mkulima

source: Male
sw: Mwanaume

source: Female
sw: Mwanamke

source: National ID
sw: Kitambulisho cha Taifa

source: Passport
sw: Pasi

source: Driving License
sw: Leseni ya Kuendesha

source: Primary
sw: Msingi

source: Secondary
sw: Sekondari

source: Diploma
sw: Stashahada

source: Degree
sw: Shahada

source: Master
sw: Uzamivu

source: PhD
sw: Uzamili

source: Small Scale
sw: Kiwango Kidogo

source: Medium Scale
sw: Kiwango cha Kati

source: Large Scale
sw: Kiwango Kikubwa

source: Commercial
sw: Biashara

source: Subsistence
sw: Kujitegemea

source: Please select...
sw: Tafadhali chagua...

# pleaseEnterFirstName
source: Please enter your first name
sw: Tafadhali ingiza jina lako la kwanza

# pleaseEnterSurname
source: Please enter your surname
sw: Tafadhali ingiza jina lako la ukoo

# pleaseEnterPhone
source: Please enter your phone number
sw: Tafadhali ingiza nambari yako ya simu

# pleaseEnterValidPhone
source: Please enter a valid phone number
sw: Tafadhali ingiza nambari halali ya simu

# pleaseSelectGender
source: Please select your gender
sw: Tafadhali chagua jinsia yako

source: Please select date of birth
sw: Tafadhali chagua tarehe ya kuzaliwa

# pleaseEnterIdentityNumber
source: Please enter your identity number
sw: Tafadhali ingiza nambari yako ya utambulisho

# pleaseSelectIdentityType
source: Please select identity card type
sw: Tafadhali chagua aina ya kitambulisho

# pleaseSelectSchoolLevel
source: Please select your school level
sw: Tafadhali chagua kiwango chako cha elimu

source: Please select farmer type
sw: Tafadhali chagua aina ya mkulima

# personalInfoStep
source: Personal
sw: Kibinafsi

# personalInfoStepSubtitle
source: Basic info
sw: Taarifa za msingi

# contactInfoStep
source: Contact
sw: Mawasiliano

# contactInfoStepSubtitle
source: Phone & email
sw: Simu na barua pepe

# identityInfoStep
source: Identity
sw: Utambulisho

# identityInfoStepSubtitle
source: ID details
sw: Maelezo ya kitambulisho

# locationInfoStep
source: Location
sw: Mahali

# locationInfoStepSubtitle
source: Address
sw: Anwani

# additionalInfoStep
source: Additional
sw: Nyingine

# additionalInfoStepSubtitle
source: Final details
sw: Maelezo ya mwisho

# enterFirstName
source: Enter your first name
sw: Ingiza jina lako la kwanza

# enterMiddleName
source: Enter your middle name (optional)
sw: Ingiza jina lako la kati (si lazima)

# enterSurname
source: Enter your surname
sw: Ingiza jina lako la ukoo

# selectDateOfBirth
source: Select your date of birth
sw: Chagua tarehe ya kuzaliwa kwako

# selectGender
source: Select your gender
sw: Chagua jinsia yako

# enterPhoneNumber
source: Enter your phone number
sw: Ingiza nambari yako ya simu

# enterAlternatePhone
source: Enter alternate phone (optional)
sw: Ingiza simu mbadala (si lazima)

# enterEmail
source: Enter your email
sw: Ingiza barua pepe yako

# enterPhysicalAddress
source: Enter your physical address
sw: Ingiza anwani yako ya kimwili

source: Select ID type
sw: Chagua aina ya kitambulisho

# enterIdNumber
source: Enter your ID number
sw: Ingiza nambari yako ya utambulisho

source: Select education level
sw: Chagua kiwango cha elimu

source: Select country
sw: Chagua nchi

source: Select region
sw: Chagua mkoa

source: Select district
sw: Chagua wilaya

source: Select ward
sw: Chagua kata

source: Select village
sw: Chagua kijiji

source: Select street
sw: Chagua mtaa

source: Select farmer type
sw: Chagua aina ya mkulima

# enterOrganizationName
source: Enter organization name (optional)
sw: Ingiza jina la shirika (si lazima)

source: Individual
sw: Mtu Binafsi

source: Organization
sw: Shirika

source: Voter ID
sw: Kitambulisho cha Mpiga Kura

source: Other
sw: Nyingine

source: Certificate
sw: Cheti

# reviewInfoMessage
source: Please review all information before submitting. You will receive a confirmation email after successful registration.
sw: Tafadhali kagua taarifa zote kabla ya kuwasilisha. Utapokea barua pepe ya uthibitisho baada ya usajili kuisha.

# registrationSuccess
source: Registration successful!
sw: Usajili umefanikiwa!

source: Registration failed
sw: Usajili umeshindwa

# firstNameRequired
source: First name is required
sw: Jina la kwanza linahitajika

# surnameRequired
source: Surname is required
sw: Jina la ukoo linahitajika

# phoneRequired
source: Phone number is required
sw: Nambari ya simu inahitajika

# validPhoneRequired
source: Enter a valid phone number
sw: Ingiza nambari halali ya simu

# emailRequired
source: Email is required
sw: Barua pepe inahitajika

# validEmailRequired
source: Enter a valid email address
sw: Ingiza barua pepe halali

# physicalAddressRequired
source: Physical address is required
sw: Anwani ya kimwili inahitajika

# genderRequired
source: Gender is required
sw: Jinsia inahitajika

# dateOfBirthRequired
source: Date of birth is required
sw: Tarehe ya kuzaliwa inahitajika

# identityTypeRequired
source: Identity card type is required
sw: Aina ya kitambulisho inahitajika

# identityNumberRequired
source: Identity number is required
sw: Nambari ya utambulisho inahitajika

# educationLevelRequired
source: Education level is required
sw: Kiwango cha elimu kinahitajika

# countryRequired
source: Country is required
sw: Nchi inahitajika

# regionRequired
source: Region is required
sw: Mkoa unahitajika

# districtRequired
source: District is required
sw: Wilaya inahitajika

# wardRequired
source: Ward is required
sw: Kata inahitajika

# villageRequired
source: Village is required
sw: Kijiji kinahitajika

# streetRequired
source: Street is required
sw: Mtaa unahitajika

# farmerTypeRequired
source: Farmer type is required
sw: Aina ya mkulima inahitajika

source: Light Mode
sw: Mandhari ya Mwangaza

source: Dark Mode
sw: Mandhari ya Giza

source: English
sw: Kiingereza

# forgotPasswordTitle
source: Forgot Password?
sw: Umesahau Nywila?

# forgotPasswordDescription
source: Choose how you would like to receive your password reset instructions
sw: Chagua jinsi ungependa kupokea maelekezo ya kubadilisha nywila yako

source: Email Address
sw: Barua Pepe

source: Phone Number
sw: Namba ya Simu

source: Recover via Email
sw: Rejesha kwa Barua Pepe

source: Recover via Phone
sw: Rejesha kwa Simu

# noInternetConnectionMessage
source: Please check your network settings and try again
sw: Tafadhali kagua mipangilio ya mtandao wako na ujaribu tena

source: Connection Lost
sw: Muunganisho Umekatika

# connectionLostMessage
source: Connection was lost during the operation. Please try again.
sw: Muunganisho ulipotea wakati wa uendeshaji. Tafadhali jaribu tena.

source: Fetching Data
sw: Inapakua Data

source: Loading Locations...
sw: Inapakia Maeneo...

source: Locations loaded successfully
sw: Maeneo yamepakiwa kwa mafanikio

source: Failed to load locations
sw: Imeshindwa kupakia maeneo

# creatingAccount
source: Creating your account...
sw: Inaunda akaunti yako...

# registrationSuccessful
source: Registration successful! Welcome to Tag & Seal.
sw: Usajili umefanikiwa! Karibu kwenye Tag & Seal.

# continueText
source: Continue
sw: Endelea

# somethingWentWrong
source: Something went wrong. Please try again.
sw: Hitilafu imetokea. Tafadhali jaribu tena.

# loggingIn
source: Logging you in...
sw: Inakuingiza...

source: Login Failed
sw: Kuingia Kumeshindwa

# loggingOut
source: Logging you out...
sw: Inakutoa...

source: Dashboard
sw: Dashibodi

source: Start
sw: Anza

source: Livestocks
sw: Mifugo

source: Events
sw: Matukio

source: User Profile
sw: Wasifu wa Mtumiaji

source: Scan QR Code
sw: Skeni Msimbo wa QR

source: QR Scanner
sw: Skena ya QR

# qrScannerDescription
source: Scanner functionality will be implemented here
sw: Utendaji wa skena utatekelezwa hapa

source: Dashboard Screen
sw: Skrini ya Dashibodi

source: All Livestocks Screen
sw: Skrini ya Mifugo Yote

source: All Events Screen
sw: Skrini ya Matukio Yote

source: User Profile Screen
sw: Skrini ya Wasifu wa Mtumiaji

source: Farmer
sw: Mkulima

# homeText
source: Home
sw: Nyumbani

# vaccinesText
source: Vaccines
sw: Chanjo

# invitedUsersText
source: Invited Users
sw: Watumiaji Walioalikwa

# invitedOfficersText
source: Invited Officers
sw: Maofisa Walioalikwa

# farmManagementText
source: Farm Management
sw: Usimamizi wa Shamba

# createNewFarmText
source: Create New Farm
sw: Unda Shamba Jipya

# inviteOfficerText
source: Invite Officer
sw: Karibisha Mofisa

# inviteFarmUserText
source: Invite Farm User
sw: Karibisha Mtumiaji wa Shamba

# collaborateText
source: Collaborate
sw: Shirikiana

# setNewFarmText
source: Set New Farm
sw: Weka Shamba Jipya

# addExtensionOfficerText
source: Add Extension Officer
sw: Ongeza Mofisa wa Uenezi

# farmsText
source: Farms
sw: Mashamba

# welcomeText
source: Welcome
sw: Karibu

# darkModeText
source: Dark Mode
sw: Mandhari ya Giza

source: Register New Farm
sw: Sajili Shamba Jipya

source: Basic Information
sw: Taarifa za Msingi

# farmNameReferenceDetails
source: Farm name and reference details
sw: Jina la shamba na maelezo ya kumbukumbu

# sizeMeasurements
source: Size & Location
sw: Ukubwa na Mahali

# farmMeasurementsCoordinates
source: Farm measurements and coordinates
sw: Vipimo vya shamba na kuratibu

source: Address & Legal
sw: Anwani na Kisheria

# physicalLocationLegalStatus
source: Physical location and legal status
sw: Mahali halisi na hali ya kisheria

source: Farm Details
sw: Maelezo ya Shamba

source: Enter farm name
sw: Ingiza jina la shamba

# farmNameRequired
source: Farm name is required
sw: Jina la shamba linahitajika

# farmNameMinLength
source: Farm name must be at least 3 characters
sw: Jina la shamba lazima liwe na angalau herufi 3

source: Reference Number
sw: Namba ya Kumbukumbu

source: Enter reference number
sw: Ingiza namba ya kumbukumbu

# referenceNumberRequired
source: Reference number is required
sw: Namba ya kumbukumbu inahitajika

source: Regional Registration Number
sw: Namba ya Usajili wa Mkoa

# enterRegionalRegNumber
source: Enter regional registration number
sw: Ingiza namba ya usajili wa mkoa

# regionalRegNumberRequired
source: Regional registration number is required
sw: Namba ya usajili wa mkoa inahitajika

# ensureReferenceAccuracy
source: Ensure all reference numbers are accurate and match official records.
sw: Hakikisha namba zote za kumbukumbu ni sahihi na zinalingana na kumbukumbu rasmi.

source: Farm Measurements
sw: Vipimo vya Shamba

source: Enter size
sw: Ingiza ukubwa

source: Size required
sw: Ukubwa unahitajika

source: Enter valid number
sw: Ingiza namba halali

# sizeMustBePositive
source: Size must be greater than 0
sw: Ukubwa lazima uwe zaidi ya 0

source: Unit
sw: Kipimo

# selectUnit
source: Select
sw: Chagua

source: Unit required
sw: Kipimo kinahitajika

source: Acres
sw: Ekari

source: Hectares
sw: Hektari

source: Square Meters
sw: Mita za Mraba

source: Square Kilometers
sw: Kilomita za Mraba

source: GPS Coordinates
sw: Kuratibu za GPS

source: Latitude
sw: Latitudo

# latitudeExample
source: e.g. -6.7924
sw: mfano -6.7924

# latitudeRequired
source: Latitude is required
sw: Latitudo inahitajika

source: Enter valid latitude
sw: Ingiza latitudo halali

# latitudeRange
source: Latitude must be between -90 and 90
sw: Latitudo lazima iwe kati ya -90 na 90

source: Longitude
sw: Longitudo

# longitudeExample
source: e.g. 39.2083
sw: mfano 39.2083

# longitudeRequired
source: Longitude is required
sw: Longitudo inahitajika

source: Enter valid longitude
sw: Ingiza longitudo halali
