Repository: vallerian-peter/new-tag-and-seal-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: sw

# confirmUpdateInsemination
source: Update insemination log?
sw: Sasisha rekodi ya upandikizaji?

# confirmSaveInsemination
source: Save insemination log?
sw: Hifadhi rekodi ya upandikizaji?

# inseminationLogSaveFailed
source: Failed to save insemination log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya upandikizaji. Jaribu tena.

# statusPending
source: Pending
sw: Inasubiri

# statusCompleted
source: Completed
sw: Imekamilika

# statusCancelled
source: Cancelled
sw: Imesitishwa

# statusFailed
source: Failed
sw: Imeshindikana

# statusScheduled
source: Scheduled
sw: Imepangwa

# confirmSaveDeworming
source: Are you sure you want to save this deworming log?
sw: Je, una uhakika unataka kuhifadhi tukio hili la dawa za minyoo?

# confirmUpdateDeworming
source: Are you sure you want to update this deworming log?
sw: Je, una uhakika unataka kusasisha tukio hili la dawa za minyoo?

# farmWithLivestockLoadFailed
source: Failed to load farm with livestock
sw: Imeshindwa kupokea shamba na mifugo

source: No farm found
sw: Hakuna shamba lililopatikana

source: No farms found
sw: Hakuna mashamba yaliyopatikana

# addCalving
source: Add calving log
sw: Ongeza rekodi ya kuzaa

# calvingDetailsSubtitle
source: Record calving outcomes and supporting details.
sw: Rekodi matokeo na maelezo ya tukio la kuzaa.

# calvingNotesSubtitle
source: Capture observations, issues, or follow-up actions.
sw: Ongeza uchunguzi, changamoto au hatua zilizochukuliwa.

source: Calving type
sw: Aina ya kuzaa

# calvingTypeRequired
source: Calving type is required
sw: Aina ya kuzaa inahitajika

source: Calving problem
sw: Tatizo la kuzaa

source: Reproductive problem
sw: Tatizo la uzazi

# ensureCalvingDetailsAccuracy
source: Ensure calving information is accurate before saving.
sw: Hakikisha taarifa za kuzaa ni sahihi kabla ya kuhifadhi.

# calvingNotesInfo
source: Add notes about calves, complications, or support provided.
sw: Ongeza maelezo kuhusu ndama, usaidizi au matatizo yaliyotokea.

# confirmUpdateCalving
source: Update calving log?
sw: Sasisha rekodi ya kuzaa?

# confirmSaveCalving
source: Save calving log?
sw: Hifadhi rekodi ya kuzaa?

# calvingLogSaveFailed
source: Failed to save calving log. Please try again.
sw: Imeshindwa kuhifadhi rekodi ya kuzaa. Jaribu tena.

source: No livestock found
sw: Hakuna mifugo iliyopatikana

source: Total
sw: Jumla

# tryDifferentSearchTerm
source: Try searching with a different term
sw: Jaribu kutafuta kwa neno tofauti

source: Timeout Error
sw: Hitilafu ya Muda

# timeoutErrorMessage
source: Connection timeout. The server took too long to respond. Please try again.
sw: Muda wa muunganisho umeisha. Seva ilichukua muda mrefu kujibu. Tafadhali ujaribu tena.

source: Invalid Request
sw: Ombi Lisilo sahihi

# invalidRequestMessage
source: Invalid request. Please check your information and try again.
sw: Ombi lisilo sahihi. Tafadhali angalia taarifa zako na ujaribu tena.

source: Service Not Found
sw: Huduma Haipatikani

# serviceNotFoundMessage
source: Service not found. Please try again later.
sw: Huduma haipatikani. Tafadhali ujaribu tena baadaye.

# genericError
source: An error occurred. Please try again.
sw: Hitilafu imetokea. Tafadhali ujaribu tena.

source: Name
sw: Jina

# nameRequired
source: Name is required
sw: Jina linahitajika

source: Select
sw: Chagua

source: Status
sw: Hali

source: Active
sw: Hai

source: Not Active
sw: Si Hai

# identificationNumber
source: ID Number
sw: Nambari ya Kitambulisho

source: Enter identification number
sw: Ingiza namba ya kitambulisho

# identificationNumberExists
source: Another livestock already uses this identification number. Please enter a unique ID.
sw: Mnyama mwingine tayari anatumia namba hii ya kitambulisho. Tafadhali tumia namba tofauti.

# identificationNumberRequired
source: Identification number is required
sw: Namba ya kitambulisho inahitajika

source: Dummy Tag ID
sw: Namba ya Lebo ya Muda

# enterDummyTagId
source: Enter dummy tag ID (optional)
sw: Ingiza namba ya lebo ya muda (si lazima)

source: Barcode Tag ID
sw: Namba ya Barcode

# enterBarcodeTagId
source: Enter barcode tag ID (optional)
sw: Ingiza namba ya barcode (si lazima)

source: RFID Tag ID
sw: Namba ya RFID

# enterRfidTagId
source: Enter RFID tag ID (optional)
sw: Ingiza namba ya RFID (si lazima)

source: Livestock Type
sw: Aina ya Mifugo

# livestockTypeRequired
source: Livestock type is required
sw: Aina ya mifugo inahitajika

source: Please select livestock type
sw: Tafadhali chagua aina ya mifugo

# speciesRequired
source: Species is required
sw: Spishi inahitajika

source: Please select species
sw: Tafadhali chagua spishi

# breedRequired
source: Breed is required
sw: Aina inahitajika

source: Please select breed
sw: Tafadhali chagua aina

source: Weight (kg)
sw: Uzito (kg)

# weightRequired
source: Weight is required
sw: Uzito unahitajika

source: Enter valid weight
sw: Ingiza uzito sahihi

# enterWeightOrBluetooth
source: Enter weight or use Bluetooth
sw: Ingiza uzito au tumia Bluetooth

# dateEnteredFarmRequired
source: Date entered farm is required
sw: Tarehe ya kuingia shambani inahitajika

source: Mother (Optional)
sw: Mama (Si Lazima)

source: Father (Optional)
sw: Baba (Si Lazima)

source: Obtained Method
sw: Njia ya Kupata

source: Physical Details
sw: Maelezo ya Kimwili

source: Additional Info
sw: Maelezo Zaidi

source: Enter livestock name
sw: Ingiza jina la mfugo

# pleaseSelectFarm
source: Please select a farm
sw: Tafadhali chagua shamba

# pleaseSelectDateEnteredFarm
source: Please select date first entered to farm
sw: Tafadhali chagua tarehe ya kuingia shambani

# confirmUpdateLivestock
source: Are you sure you want to update this livestock?
sw: Una uhakika unataka kusasisha mifugo hii?

# confirmRegisterLivestock
source: Are you sure you want to register this livestock?
sw: Una uhakika unataka kusajili mifugo hii?

source: Livestock updated successfully
sw: Mifugo imesasishwa kikamilifu

source: Livestock registered successfully
sw: Mifugo imesajiliwa kikamilifu

source: Failed to save livestock
sw: Imeshindwa kuhifadhi mifugo

source: Farm Location
sw: Mahali pa Shamba

# selectWhereLocated
source: Select where this livestock is located
sw: Chagua mahali mifugo iko

source: Basic Details
sw: Maelezo ya Msingi

# enterNameAndId
source: Enter livestock name and primary identification
sw: Ingiza jina na kitambulisho cha msingi

source: Tag Identification
sw: Kitambulisho cha Lebo

# optionalEnterTagIds
source: Optional: Enter tag IDs for tracking
sw: Si Lazima: Ingiza namba za lebo kwa ufuatiliaji

source: Livestock Classification
sw: Uainishaji wa Mifugo

# selectTypeSpeciesBreed
source: Select type, species, and breed
sw: Chagua aina, spishi, na aina

source: Physical Characteristics
sw: Sifa za Kimwili

# enterGenderWeightBirth
source: Enter gender, weight, and birth date
sw: Ingiza jinsia, uzito, na tarehe ya kuzaliwa

source: Parentage Information
sw: Taarifa za Wazazi

# optionalSelectParents
source: Optional: Select mother and father
sw: Si Lazima: Chagua mama na baba

source: Acquisition Details
sw: Maelezo ya Upatikanaji

# howAndWhenObtained
source: How and when livestock was obtained
sw: Jinsi na wakati mifugo ilipatikana

source: Livestock Status
sw: Hali ya Mifugo

# setCurrentStatus
source: Set the current status of this livestock
sw: Weka hali ya sasa ya mifugo hii

source: Farm, name, and identification
sw: Shamba, jina, na kitambulisho

# typeSpeciesBreedCharacteristics
source: Type, species, breed, and characteristics
sw: Aina, spishi, aina, na sifa

source: Parents, method, and dates
sw: Wazazi, njia, na tarehe

source: Actions
sw: Vitendo

source: Edit Livestock
sw: Hariri Mifugo

source: Delete Livestock
sw: Futa Mifugo

# confirmDelete
source: Are you sure you want to delete
sw: Je, una uhakika unataka kufuta

source: deleted successfully
sw: imefutwa kwa mafanikio

source: Failed to delete
sw: Imeshindwa kufuta

source: Add vaccine
sw: Ongeza chanjo

source: Disposal
sw: Utupaji

source: Not provided
sw: Haijatolewa

source: Role
sw: Wadhifa

# unsyncedDataWarning
source: You have unsynced data. Sync before logging out to avoid losing recent changes.
sw: Una data ambayo haijasawazishwa. Hakikisha unasawazisha kabla ya kutoka ili kuepuka kupoteza mabadiliko.

# noUnsyncedDataMessage
source: No unsynced data found. It is safe to log out.
sw: Hakuna data iliyosalia kusawazishwa. Unaweza kutoka salama.

# syncAndLogout
source: Sync & Logout
sw: Sawazisha na utoke

# syncingBeforeLogout
source: Syncing pending data before logging out...
sw: Kusawazisha data kabla ya kutoka...

source: Add notification
sw: Ongeza taarifa

# noNotifications
source: No notifications yet
sw: Hakuna taarifa kwa sasa

# upcomingToday
source: Today
sw: Leo

# upcomingNotifications
source: Upcoming
sw: Zijazo

source: All notifications
sw: Taarifa zote

source: Notification title
sw: Kichwa cha taarifa

# enterNotificationTitle
source: Enter a notification title
sw: Ingiza kichwa cha taarifa

# notificationDescription
source: Description
sw: Maelezo

# enterNotificationDescription
source: Enter a description
sw: Ingiza maelezo

# optionalFieldHint
source: Optional
sw: Hiari

source: Schedule date
sw: Ratibu tarehe

source: Schedule time
sw: Ratibu muda

source: Save notification
sw: Hifadhi taarifa

# notificationChipToday
source: Today
sw: Leo

# notificationChipUpcoming
source: Upcoming
sw: Zijazo

source: Mark completed
sw: Weka kuwa imekamilika

source: Delete notification
sw: Futa taarifa

# notificationScheduledOn
source: Scheduled on {dateLabel}
sw: Imepewa ratiba {dateLabel}

# selectAlarmSound
source: Alarm sound
sw: Sauti ya kengele

# alarmSoundSelected
source: Current sound: {soundName}
sw: Sauti iliyochaguliwa: {soundName}

# chooseSound
source: Choose audio
sw: Chagua sauti

# previewSound
source: Preview
sw: Chezesha mfano

source: Stop preview
sw: Acha mfano

# loopSound
source: Loop sound until stopped
sw: Rudia sauti hadi uisimamishe

source: Vibrate device
sw: Tikisisha kifaa

source: Alarm volume
sw: Kiasi cha sauti ya kengele

# previewSoundFailed
source: Unable to preview sound
sw: Imeshindikana kucheza sauti

source: Stop alarm
sw: Zima kengele

# repeatDailyLabel
source: Repeat every day
sw: Rudia kila siku

# repeatDailyHint
source: Alarm will ring at this time daily.
sw: Kengele italia saa hii kila siku.

# selectTimeLabel
source: Alarm time
sw: Saa ya kengele

# selectTimeHint
source: Tap to choose a daily time
sw: Gonga uchague saa ya kila siku

# selectTimeRequired
source: Please select a time
sw: Tafadhali chagua saa

# scanUnsupportedDevice
source: Scanning is not supported on this device.
sw: Kifaa hiki hakiungi mkono usomaji wa lebo.

# scanPermissionDenied
source: Camera permission denied.
sw: Ruhusa ya kamera imekataliwa.

# scanPermissionRationaleTitle
source: Camera access required
sw: Tunahitaji ufikiaji wa kamera

# scanPermissionRationaleMessage
source: Tag scanning needs camera access. Please allow permission to continue.
sw: Ili kusoma lebo za mifugo tunahitaji ruhusa ya kamera.

# scanPermissionNotNow
source: Not now
sw: Sio sasa

# scanPermissionAllow
source: Allow
sw: Ruhusu

# scanPermissionSettingsTitle
source: Permission required
sw: Ruhusa inahitajika

# scanPermissionSettingsMessage
source: Enable camera permission in settings to continue scanning.
sw: Washia ruhusa ya kamera kwenye mipangilio ili kuendelea.

# scanPermissionGoToSettings
source: Open settings
sw: Fungua mipangilio

# scanOptionQr
source: QR code
sw: QR

# scanOptionQrDescription
source: Scan QR code tags
sw: Soma lebo za QR

# scanOptionBarcodeDescription
source: Scan printed barcodes
sw: Soma barcode zilizochapishwa

# scanOptionRfidDescription
source: Use RFID reader
sw: Tumia kisomaji cha RFID

# scanTagsTitle
source: Scan tags
sw: Soma lebo

# scanTagsSubtitle
source: Choose how you want to scan
sw: Chagua njia ya kusoma

# scanStartButton
source: Start scanning
sw: Anza kusoma

# scanResultNotFound
source: No livestock found for tag {tag}
sw: Hakuna mifugo iliyo patikana kwa lebo {tag}

# scanRfidPlaceholder
source: Enter RFID code
sw: Ingiza namba ya RFID

# scanManualPlaceholder
source: Enter tag manually
sw: Ingiza lebo kwa mkono

# scanManualConfirm
source: Confirm tag
sw: Thibitisha lebo

source: Vaccine saved successfully
sw: Chanjo imehifadhiwa kikamilifu

# vaccineSaveFailed
source: Failed to save vaccine. Please try again.
sw: Imeshindwa kuhifadhi chanjo. Jaribu tena.

source: Vaccine updated successfully
sw: Chanjo imesasishwa kikamilifu

source: Vaccine details
sw: Maelezo ya chanjo

# vaccineDetailsSubtitle
source: Provide accurate vaccine information
sw: Weka taarifa sahihi ya chanjo

source: Vaccine type
sw: Aina ya chanjo

source: Select vaccine type
sw: Chagua aina ya chanjo

# vaccineTypesMissing
source: Vaccine types missing. Sync reference data first.
sw: Hakuna aina za chanjo. Sawazisha data ya marejeo kwanza.

# vaccineTypeRequired
source: Vaccine type is required
sw: Aina ya chanjo inahitajika

source: Lot number
sw: Namba ya kundi

source: Enter lot number
sw: Ingiza namba ya kundi

source: Formulation type
sw: Aina ya utengenezaji

source: Select formulation type
sw: Chagua aina ya utengenezaji

source: Dose amount
sw: Kiasi cha dozi

source: Enter dose amount
sw: Ingiza kiasi cha dozi

source: Dose unit
sw: Kipimo cha dozi

source: Select dose unit
sw: Chagua kipimo cha dozi

# vaccineSchedule
source: Schedule
sw: Ratiba

# selectVaccineSchedule
source: Select schedule
sw: Chagua ratiba

source: Vaccine status
sw: Hali ya chanjo

source: Select status
sw: Chagua hali

# ensureVaccineDetailsAccuracy
source: Ensure the vaccine details are accurate before saving.
sw: Hakikisha taarifa za chanjo ni sahihi kabla ya kuhifadhi.

# confirmUpdateVaccine
source: Update vaccine details?
sw: Sasisha taarifa za chanjo?

# confirmSaveVaccine
source: Save this vaccine?
sw: Hifadhi chanjo hii?

# vaccineScheduleRegular
source: Regular schedule
sw: Ratiba ya kawaida

# vaccineScheduleSeasonal
source: Seasonal
sw: Ratiba ya msimu

# vaccineScheduleEmergency
source: Emergency
sw: Ratiba ya dharura

# bluetoothNotSupported
source: Bluetooth is not supported on this device
sw: Bluetooth haitumiki kwenye kifaa hiki

# bluetoothPermissionsRequired
source: Bluetooth permissions are required to scan for devices. Please grant permissions when prompted.
sw: Ruhusa za Bluetooth zinahitajika ili kutafuta vifaa. Tafadhali ruhusu ruhusa unapoombwa.

# bluetoothPermissionsPermanentlyDenied
source: Bluetooth permissions were permanently denied. Please enable them in app settings.
sw: Ruhusa za Bluetooth zilikataliwa kabisa. Tafadhali ziwashie katika mipangilio ya programu.

# bluetoothTurnOnRequired
source: Please turn on Bluetooth to scan for devices
sw: Tafadhali washa Bluetooth ili kutafuta vifaa

# bluetoothTurnOnInstructions
source: Go to your device settings and turn on Bluetooth, then try again.
sw: Nenda kwenye mipangilio ya kifaa chako na washa Bluetooth, kisha jaribu tena.

# bluetoothUnknownError
source: An unexpected error occurred. Please try again.
sw: Hitilafu isiyotarajiwa ilitokea. Tafadhali jaribu tena.

source: Open Settings
sw: Fungua Mipangilio

# makeSureScaleOn
source: Make sure your scale is turned on
sw: Hakikisha kipimo chako kimewashwa

source: Enable Bluetooth
sw: Washa Bluetooth

# bluetoothLocationRequired
source: Location services are required for Bluetooth scanning on Android. Please enable location services in your device settings.
sw: Huduma za eneo zinahitajika kwa kuchunguza Bluetooth kwenye Android. Tafadhali washa huduma za eneo katika mipangilio ya kifaa chako.
